src/Catalogs/ИнтерфейсыКлиента/ИнтерфейсыКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнтерфейсыКлиента</name>
  <predefined>
    <items>
      <name>МобильныйКлиент</name>
      <description>Мобильный клиент</description>
    </items>
    <items>
      <name>ПолныйИнтерфейс</name>
      <description>Полный интерфейс</description>
    </items>
  </predefined>
  <attributes>
    <name>ОтображатьВсеОбъекты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ИнтерфейсыКлиента/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьИнтерфейс() Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   Ссылка,
    |   ОтображатьВсеОбъекты
    |ИЗ
    |   Справочник.ИнтерфейсыКлиента
    |ГДЕ
    |   Предопределенный
    |";
    
    Запрос.Выполнить();
    
    УстановитьПривилегированныйРежим(Истина);
    
    Результат = Запрос.Выполнить();
    
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        
        Если Выборка.Ссылка = Справочники.ИнтерфейсыКлиента.ПолныйИнтерфейс И НЕ Выборка.ОтображатьВсеОбъекты Тогда
            СпрОбъект = Справочники.ИнтерфейсыКлиента.ПолныйИнтерфейс.ПолучитьОбъект();
            СпрОбъект.ОтображатьВсеОбъекты = Истина;
            СпрОбъект.Записать();
        ИначеЕсли Выборка.Ссылка = Справочники.ИнтерфейсыКлиента.МобильныйКлиент И Выборка.ОтображатьВсеОбъекты Тогда
            СпрОбъект = Справочники.ИнтерфейсыКлиента.МобильныйКлиент.ПолучитьОбъект();
            СпрОбъект.ОтображатьВсеОбъекты = Ложь;
            СпрОбъект.Записать();
        КонецЕсли;
        
    КонецЦикла;
        
КонецПроцедуры

#КонецОбласти
    
#КонецЕсли
